GIT/src/InformationRegisters/ТаблицаЛидеров/ТаблицаЛидеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТаблицаЛидеров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОчков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Игрок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Игра</name>
    <type>
      <types>EnumRef.Игры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GIT/src/InformationRegisters/ТаблицаЛидеров/ManagerModule.bsl
Процедура ЗаписатьВТаблицуЛидеров(Игрок, Игра, КоличествоОчков) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ТаблицаЛидеров.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период 			= ТекущаяДата();
	МенеджерЗаписи.Игрок 			= Игрок;
	МенеджерЗаписи.Игра 			= Игра;
	МенеджерЗаписи.КоличествоОчков 	= КоличествоОчков;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
